Repository: kkelis/todolio
Catalog: lib/l10n/app_*.arb
Languages: hr

source: Save
hr: Spremi

source: Cancel
hr: Odustani

source: Delete
hr: Obriši

source: Edit
hr: Uredi

source: Close
hr: Zatvori

source: Retry
hr: Pokušaj ponovo

source: Done
hr: Gotovo

source: OK
hr: U redu

# errorWithDetails
source: Error: {error}
hr: Greška: {error}

# errorLoadingSettings
source: Error loading settings: {error}
hr: Greška pri učitavanju postavki: {error}

source: Not set
hr: Nije postavljeno

# dateAndTime
source: Date & Time
hr: Datum i vrijeme

source: Priority
hr: Prioritet

source: Repeat
hr: Ponavljanje

source: Pinned
hr: Zakačeno

source: Completed
hr: Završeno

source: Overdue
hr: Zakašnjelo

source: Today
hr: Danas

source: Next 7 Days
hr: Sljedećih 7 dana

source: Later
hr: Kasnije

source: Please enter some text
hr: Unesite neki tekst

source: Title cannot be empty
hr: Naslov ne može biti prazan

# repeatNone
source: None
hr: Bez ponavljanja

# repeatDaily
source: Daily
hr: Svaki dan

# repeatWeekly
source: Weekly
hr: Svaki tjedan

# repeatMonthly
source: Monthly
hr: Svaki mjesec

# repeatYearly
source: Yearly
hr: Svake godine

source: All
hr: Sve

source: Pending
hr: Na čekanju

source: Color
hr: Boja

# colorNone
source: None
hr: Bez boje

source: Unit
hr: Jedinica

# brandSelectionTitle
source: Select Brand
hr: Odaberi brend

# brandSearchHint
source: Search brands...
hr: Pretraži brendove...

source: Create Custom Brand
hr: Stvori prilagođeni brend

source: Select a Brand
hr: Odaberi brend

source: No brands found
hr: Nema pronađenih brendova

# brandNameLabel
source: Brand Name
hr: Naziv brenda

# brandNameHint
source: Enter brand name
hr: Unesite naziv brenda

source: Select Color
hr: Odaberi boju

source: Continue to Scan
hr: Nastavi na skeniranje

# guaranteesTitle
source: Guarantees
hr: Garancije

source: No guarantees
hr: Nema garancija

source: Add Guarantee
hr: Dodaj garanciju

source: Edit Guarantee
hr: Uredi garanciju

# productNameLabel
source: Product Name
hr: Naziv proizvoda

source: Purchase Date
hr: Datum kupnje

source: Expiry Date
hr: Datum isteka

# warrantyPhotoButton
source: Warranty
hr: Garancija

# receiptPhotoButton
source: Receipt
hr: Račun

source: Warranty photo captured
hr: Fotografija garancije snimljena

source: Receipt photo captured
hr: Fotografija računa snimljena

# notesLabel
source: Notes
hr: Bilješke

source: Set Reminder
hr: Postavi podsjetnik

source: Remind me
hr: Podsjeti me

# reminderMonthsBeforeSingular
source: {count} month before
hr: {count} mjesec prije

# reminderMonthsBeforePlural
source: {count} months before
hr: {count} mjeseca prije

# warrantyPhotoDetailLabel
source: Warranty Photo:
hr: Fotografija garancije:

# receiptPhotoDetailLabel
source: Receipt Photo:
hr: Fotografija računa:

# guaranteeExpiresOn
source: Expires: {date}
hr: Ističe: {date}

# guaranteeExpired
source: EXPIRED
hr: ISTEKLO

# guaranteeExpiringSoon
source: Expiring soon
hr: Uskoro ističe

# loyaltyCardsTitle
source: Loyalty Cards
hr: Kartice vjernosti

# loyaltyCardsSearchHint
source: Search loyalty cards...
hr: Pretražite kartice vjernosti...

source: No loyalty cards
hr: Nema kartica vjernosti

source: No cards found
hr: Nema pronađenih kartica

source: Card unpinned
hr: Kartica otkačena

source: Card pinned to top
hr: Kartica zakačena na vrh

# tooltipUnpin
source: Unpin
hr: Otkači

# tooltipPinToTop
source: Pin to top
hr: Zakači na vrh

# tooltipDelete
source: Delete
hr: Obriši

# defaultLoyaltyCardName
source: Loyalty Card
hr: Kartica vjernosti

# cardAddedSuccess
source: Card "{cardName}" added successfully!
hr: Kartica "{cardName}" uspješno dodana!

source: Add Loyalty Card
hr: Dodaj karticu vjernosti

source: Edit Loyalty Card
hr: Uredi karticu vjernosti

# cardNameLabel
source: Card Name
hr: Naziv kartice

# brandFieldLabel
source: Brand
hr: Brend

# genericCardFallback
source: Generic Card
hr: Generička kartica

# barcodeNumberLabel
source: Barcode Number
hr: Broj barkoda

# scanButtonLabel
source: Scan
hr: Skeniraj

# fillInCardNameAndBarcode
source: Please fill in card name and barcode number
hr: Molimo ispunite naziv kartice i broj barkoda

# scanBarcodeTitle
source: Scan Barcode
hr: Skenirajte barkod

# tooltipPickFromGallery
source: Pick from gallery
hr: Odaberi iz galerije

# noBarcodeFoundInImage
source: No barcode found in the selected image
hr: U odabranoj slici nije pronađen barkod

# errorScanningImage
source: Error scanning image: {error}
hr: Greška pri skeniranju slike: {error}

# navTasks
source: Tasks
hr: Zadaci

# navShopping
source: Shopping
hr: Kupovina

# navCards
source: Cards
hr: Kartice

# navGuarantees
source: Guarantees
hr: Garancije

# navNotes
source: Notes
hr: Bilješke

source: No sections enabled
hr: Nema aktivnih sekcija

# enableAtLeastOneSection
source: Enable at least one section in Settings
hr: Aktivirajte barem jednu sekciju u Postavkama

source: Open Settings
hr: Otvori postavke

# drawerSettings
source: Settings
hr: Postavke

# drawerTestNotification
source: Test Notification
hr: Test obavijest

# drawerTestNotificationSubtitle
source: Send a test notification
hr: Pošalji testnu obavijest

source: Test notification sent!
hr: Testna obavijest poslana!

# drawerRequestPermissions
source: Request Permissions
hr: Zatraži dozvole

# drawerRequestPermissionsSubtitle
source: Request notification permissions
hr: Zatraži dozvole za obavijesti

source: Notification permissions granted! ✅
hr: Dozvole za obavijesti odobrene! ✅

# notificationPermissionsDenied
source: Notification permissions denied. Please enable in settings.
hr: Dozvole za obavijesti odbijene. Molimo omogućite ih u postavkama.

# drawerCheckNotificationStatus
source: Check Notification Status
hr: Provjeri status obavijesti

# drawerCheckNotificationStatusSubtitle
source: View notification status and pending notifications
hr: Pogledajte status obavijesti i čekajuće obavijesti

# notificationStatusDialogTitle
source: Notification Status
hr: Status obavijesti

source: Notifications Enabled: {status}
hr: Obavijesti omogućene: {status}

source: Pending Notifications: {count}
hr: Čekajuće obavijesti: {count}

# notificationStatusPendingHeader
source: Pending:
hr: Na čekanju:

# andNMore
source: ... and {count} more
hr: ... i još {count}

# notificationsDisabledWarning
source: ⚠️ Notifications are disabled. Please enable them in Settings.
hr: ⚠️ Obavijesti su onemogućene. Molimo omogućite ih u Postavkama.

source: Dev Mode - No Auth
hr: Dev Mode - Bez autentifikacije

# devModeNoAuthSubtitle
source: Authentication disabled for development
hr: Autentifikacija onemogućena za razvoj

# notesTitle
source: Notes
hr: Bilješke

# notesSearchHint
source: Search notes...
hr: Pretražite bilješke...

source: No notes
hr: Nema bilješki

source: Add Note
hr: Dodaj bilješku

source: Edit Note
hr: Uredi bilješku

# noteTitleLabel
source: Title
hr: Naslov

# noteContentLabel
source: Content
hr: Sadržaj

# noteTagsLabel
source: Tags (comma separated)
hr: Oznake (odvojene zarezom)

# noteTagsHint
source: work, personal, ideas
hr: posao, osobno, ideje

# remindersTitle
source: Reminders
hr: Podsjetnici

source: No reminders
hr: Nema podsjetnika

source: Add Reminder
hr: Dodaj podsjetnik

source: Edit Reminder
hr: Uredi podsjetnik

# addReminderHint
source: Add your reminder here
hr: Ovdje dodajte podsjetnik

# reminderTypeLabel
source: Reminder type
hr: Vrsta podsjetnika

# reminderTypeBirthday
source: Birthday
hr: Rođendan

# reminderTypeAppointment
source: Appointment
hr: Termin

# reminderTypeTodo
source: Todo
hr: Obveza

# reminderTypeOther
source: Other
hr: Ostalo

# settingsTitle
source: Settings
hr: Postavke

# settingsAppSectionsHeader
source: App Sections
hr: Sekcije aplikacije

# settingsAppSectionsSubtitle
source: Select which sections you want to see in the app
hr: Odaberite koje sekcije želite vidjeti u aplikaciji

# sectionTasks
source: Tasks
hr: Zadaci

# sectionShoppingLists
source: Shopping Lists
hr: Liste kupovine

# sectionGuarantees
source: Guarantees
hr: Garancije

# sectionNotes
source: Notes
hr: Bilješke

# sectionLoyaltyCards
source: Loyalty Cards
hr: Kartice vjernosti

# settingsColorSchemeHeader
source: Color Scheme
hr: Shema boja

# settingsColorSchemeSubtitle
source: Choose your preferred color theme
hr: Odaberite željenu temu boja

# settingsBackupHeader
source: Backup & Restore
hr: Backup i obnova

# settingsBackupSubtitle
source: Backup your data to transfer to a new device
hr: Napravite backup podataka za prijenos na novi uređaj

# settingsAtLeastOneSection
source: At least one section must be enabled
hr: Barem jedna sekcija mora biti aktivna

# settingsAboutHeader
source: About
hr: O aplikaciji

# settingsAboutSubtitle
source: Legal information and app details
hr: Pravne informacije i detalji aplikacije

# backupLastDate
source: Last backup: {date}
hr: Zadnji backup: {date}

# backupNeverBackedUp
source: Never backed up
hr: Nikad nije napravljen backup

# createBackupButton
source: Create Backup
hr: Stvori backup

# restoreButton
source: Restore
hr: Obnovi

# backupRemindersToggle
source: Backup Reminders
hr: Podsjetnici za backup

# reminderFrequencyLabel
source: Reminder Frequency
hr: Učestalost podsjetnika

# frequencyDays
source: {count} days
hr: {count} dana

# privacyPolicyTitle
source: Privacy Policy
hr: Politika privatnosti

# termsOfServiceTitle
source: Terms of Service
hr: Uvjeti korištenja

# versionLabel
source: Version
hr: Verzija

source: Could not open {url}
hr: Nije moguće otvoriti {url}

# errorOpeningLink
source: Error opening link: {error}
hr: Greška pri otvaranju linka: {error}

# backupDateToday
source: today
hr: danas

# backupDateYesterday
source: yesterday
hr: jučer

# backupDateDaysAgo
source: {count} days ago
hr: prije {count} dana

# backupDateWeekAgo
source: {count} week ago
hr: prije {count} tjedan

# backupDateWeeksAgo
source: {count} weeks ago
hr: prije {count} tjedna

# backupDateMonthAgo
source: {count} month ago
hr: prije {count} mjesec

# backupDateMonthsAgo
source: {count} months ago
hr: prije {count} mjeseci

# restoreBackupDialogTitle
source: Restore Backup
hr: Obnovi backup

# restoreBackupDialogContent
source: How would you like to restore the backup? • Replace: Delete all current data and restore from backup • Merge: Combine backup data with current data
hr: Kako želite obnoviti backup? • Zamijeni: Izbriši sve trenutne podatke i obnovi iz backupa • Spoji: Kombiniraj podatke iz backupa s trenutnim podacima

# restoreMerge
source: Merge
hr: Spoji

# restoreReplace
source: Replace
hr: Zamijeni

# backupCreatedSuccess
source: Backup created successfully!
hr: Backup uspješno stvoren!

source: Backup cancelled
hr: Backup otkazan

# errorCreatingBackup
source: Error creating backup: {error}
hr: Greška pri stvaranju backupa: {error}

# backupRestoredSuccess
source: Backup restored successfully! Data reloaded.
hr: Backup uspješno obnovljen! Podaci ponovno učitani.

source: Restore cancelled
hr: Obnova otkazana

# errorRestoringBackup
source: Error restoring backup: {error}
hr: Greška pri obnovi backupa: {error}

# shoppingListsTitle
source: Shopping Lists
hr: Liste kupovine

# tooltipImportCsv
source: Import CSV
hr: Uvezi CSV

source: No shopping lists
hr: Nema lista kupovine

# importedListSuccess
source: Imported "{name}" with {itemCount} items
hr: Uvezeno "{name}" s {itemCount} stavki

# failedToImport
source: Failed to import: {error}
hr: Uvoz nije uspio: {error}

source: Shopping list exported!
hr: Lista kupovine izvezena!

# failedToExport
source: Failed to export: {error}
hr: Izvoz nije uspio: {error}

# tooltipExportAsCsv
source: Export as CSV
hr: Izvezi kao CSV

# shoppingListItemsCount
source: {completed} / {total} items
hr: {completed} / {total} stavki

# shoppingListNameHint
source: List name
hr: Naziv liste

# shoppingListEmptyState
source: No items yet Start adding below!
hr: Nema stavki Počnite dodavati ispod!

# restoreCheckedItemLabel
source: Restore checked item
hr: Obnovi označenu stavku

# itemNameHint
source: Item name…
hr: Naziv stavke…

# itemAlreadyOnList
source: "{name}" is already on the list
hr: "{name}" je već na listi

# editItemDialogTitle
source: Edit Item
hr: Uredi stavku

# itemNameLabel
source: Item Name
hr: Naziv stavke

# quantityLabel
source: Quantity
hr: Količina

# pleaseEnterItemName
source: Please enter an item name
hr: Molimo unesite naziv stavke

# shoppingTitle
source: Shopping
hr: Kupovina

# noSectionsEnabledShopping
source: No sections enabled
hr: Nema aktivnih sekcija

# tabShoppingLists
source: Shopping Lists
hr: Liste kupovine

# tabLoyaltyCards
source: Loyalty Cards
hr: Kartice vjernosti

# tasksTitle
source: Tasks
hr: Zadaci

# filterAllTasks
source: All Tasks
hr: Svi zadaci

# filterReminders
source: Reminders
hr: Podsjetnici

# filterTodos
source: Todos
hr: Obveze

source: No tasks
hr: Nema zadataka

# tasksFilterActive
source: Filter: {filter}
hr: Filtar: {filter}

# sectionNoDate
source: No Date
hr: Bez datuma

# sectionHighPriority
source: High Priority
hr: Visoki prioritet

# sectionMediumPriority
source: Medium Priority
hr: Srednji prioritet

# sectionLowPriority
source: Low Priority
hr: Niski prioritet

source: Add Task
hr: Dodaj zadatak

source: Edit Task
hr: Uredi zadatak

# addTaskHint
source: Add your task here
hr: Ovdje dodajte zadatak

# taskTypeLabel
source: Task type
hr: Vrsta zadatka

# taskTypeBirthday
source: Birthday
hr: Rođendan

# taskTypeAppointment
source: Appointment
hr: Termin

# taskTypeToDo
source: To-Do
hr: Obveza

# taskTypeWarranty
source: Warranty
hr: Garancija

# taskTypeOther
source: Other
hr: Ostalo

# todosTitle
source: To-Dos
hr: Obveze

source: No to-dos
hr: Nema obveza

source: Add To-Do
hr: Dodaj obvezu

source: Edit To-Do
hr: Uredi obvezu

# addToDoHint
source: Add your to-do here
hr: Ovdje dodajte obvezu

# deleteDialogDefaultMessage
source: This action cannot be undone.
hr: Ova radnja se ne može poništiti.

# settingsLanguageHeader
source: Language
hr: Jezik

# settingsLanguageSubtitle
source: Choose the app language
hr: Odaberi jezik aplikacije

# languageSystemDefault
source: System default
hr: Zadano (sustav)
